---
kind: type
id: T:Autodesk.Revit.UI.UISaveAsOptions
source: html/3aed4f35-aeda-a06f-2b6e-d7c40e93d529.htm
---
# Autodesk.Revit.UI.UISaveAsOptions

This class contains UI options available for saving a document to disk with a new filename.

## Syntax (C#)
```csharp
public class UISaveAsOptions : IDisposable
```